## Series

- Series are similar to numpy array
- Series are built on top of numpy array
- Difference is that a series can be accessed by label

In [1]:
import numpy as np 
import pandas as pd

### Creating series from different Python objects

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Grabbing data from a Series

In [7]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Singapore', 'India', 'China'])

In [8]:
ser1

USA          1
Singapore    2
India        3
China        4
dtype: int64

In [10]:
ser1['USA']

1

In [11]:
ser1+ser1

USA          2
Singapore    4
India        6
China        8
dtype: int64

## DataFrames

In [1]:
import numpy as np 
import pandas as pd 

from numpy.random import randn 

np.random.seed(108)

In [2]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [3]:
df

          W         X         Y         Z
A -1.026905  0.221749  1.130390  1.146185
B -0.592734  0.118784 -0.484430 -1.944913
C  0.092077  0.902169  1.314469  0.771102
D -0.540147 -0.284115 -0.889331  0.404169
E -1.144812  0.545396  1.454070  1.223977

Each column is a series

In [4]:
df['W'] #is a series

A   -1.026905
B   -0.592734
C    0.092077
D   -0.540147
E   -1.144812
Name: W, dtype: float64

In [5]:
type(df['W'] )

pandas.core.series.Series

In [6]:
df.W

A   -1.026905
B   -0.592734
C    0.092077
D   -0.540147
E   -1.144812
Name: W, dtype: float64

### List of column names

In [8]:
df[['W', 'Z']] # This returns a dataframe

          W         Z
A -1.026905  1.146185
B -0.592734 -1.944913
C  0.092077  0.771102
D -0.540147  0.404169
E -1.144812  1.223977

### Creating a new column

In [10]:
df["new"] = df['W']+df['Y']
df

          W         X         Y         Z       new
A -1.026905  0.221749  1.130390  1.146185  0.103486
B -0.592734  0.118784 -0.484430 -1.944913 -1.077165
C  0.092077  0.902169  1.314469  0.771102  1.406546
D -0.540147 -0.284115 -0.889331  0.404169 -1.429479
E -1.144812  0.545396  1.454070  1.223977  0.309258

### Removing columns

In [11]:
df.drop("new") # this does not work because drop is referring to index

KeyError: "['new'] not found in axis"

In [12]:
df.drop("new", axis=1) #does not happen in place

          W         X         Y         Z
A -1.026905  0.221749  1.130390  1.146185
B -0.592734  0.118784 -0.484430 -1.944913
C  0.092077  0.902169  1.314469  0.771102
D -0.540147 -0.284115 -0.889331  0.404169
E -1.144812  0.545396  1.454070  1.223977

In [13]:
df

          W         X         Y         Z       new
A -1.026905  0.221749  1.130390  1.146185  0.103486
B -0.592734  0.118784 -0.484430 -1.944913 -1.077165
C  0.092077  0.902169  1.314469  0.771102  1.406546
D -0.540147 -0.284115 -0.889331  0.404169 -1.429479
E -1.144812  0.545396  1.454070  1.223977  0.309258

In [14]:
df.drop("new", axis=1, inplace=True)

In [17]:
df

          W         X         Y         Z
A -1.026905  0.221749  1.130390  1.146185
B -0.592734  0.118784 -0.484430 -1.944913
C  0.092077  0.902169  1.314469  0.771102
D -0.540147 -0.284115 -0.889331  0.404169
E -1.144812  0.545396  1.454070  1.223977

### Dropping column

In [18]:
df.drop("E") #Need inplace=True to actually drop

          W         X         Y         Z
A -1.026905  0.221749  1.130390  1.146185
B -0.592734  0.118784 -0.484430 -1.944913
C  0.092077  0.902169  1.314469  0.771102
D -0.540147 -0.284115 -0.889331  0.404169

### Selecting Rows

By row name

In [20]:
df.loc['E'] #takes in a label

W   -1.144812
X    0.545396
Y    1.454070
Z    1.223977
Name: E, dtype: float64

By index

In [22]:
df.iloc[4]

W   -1.144812
X    0.545396
Y    1.454070
Z    1.223977
Name: E, dtype: float64

### Selecting subsets of rows & columns

In [24]:
df.loc['B','Y'] #similar to numpy

-0.484430212868116

In [26]:
df.loc[['A','B'], ['W', 'Y']] #can pass in a list of rows and columns we want

          W        Y
A -1.026905  1.13039
B -0.592734 -0.48443

### Conditional selection

In [30]:
booldf = df > 0
booldf

       W      X      Y      Z
A  False   True   True   True
B  False   True  False  False
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [31]:
df[booldf]

          W         X         Y         Z
A       NaN  0.221749  1.130390  1.146185
B       NaN  0.118784       NaN       NaN
C  0.092077  0.902169  1.314469  0.771102
D       NaN       NaN       NaN  0.404169
E       NaN  0.545396  1.454070  1.223977

In [36]:
df[df>0]

          W         X         Y         Z
A       NaN  0.221749  1.130390  1.146185
B       NaN  0.118784       NaN       NaN
C  0.092077  0.902169  1.314469  0.771102
D       NaN       NaN       NaN  0.404169
E       NaN  0.545396  1.454070  1.223977

In [38]:
df['W']>0 #returns a bool series

A    False
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [41]:
df[df['W']<0]

          W         X         Y         Z
A -1.026905  0.221749  1.130390  1.146185
B -0.592734  0.118784 -0.484430 -1.944913
D -0.540147 -0.284115 -0.889331  0.404169
E -1.144812  0.545396  1.454070  1.223977

In [44]:
df[df["Z"]<0]

          W         X        Y         Z
B -0.592734  0.118784 -0.48443 -1.944913

In [46]:
df[df['W']<0]['X']

A    0.221749
B    0.118784
D   -0.284115
E    0.545396
Name: X, dtype: float64

### Multiple conditions

In [51]:
df[(df['W']>0) and (df['Y']<0)] #Python cannot understand a series vs series. It can only deal with single instances of boolean values

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [52]:
df[(df['W']<0) & (df['Y']<0)] #we need & instead of and

          W         X         Y         Z
B -0.592734  0.118784 -0.484430 -1.944913
D -0.540147 -0.284115 -0.889331  0.404169

In [53]:
df[(df['W']<0) | (df['Y']<0)] #| instead of or

          W         X         Y         Z
A -1.026905  0.221749  1.130390  1.146185
B -0.592734  0.118784 -0.484430 -1.944913
D -0.540147 -0.284115 -0.889331  0.404169
E -1.144812  0.545396  1.454070  1.223977

## Index Stuff

### Setting it to default 0,1,2,3,4...

In [54]:
df.reset_index() #inplace required

  index         W         X         Y         Z
0     A -1.026905  0.221749  1.130390  1.146185
1     B -0.592734  0.118784 -0.484430 -1.944913
2     C  0.092077  0.902169  1.314469  0.771102
3     D -0.540147 -0.284115 -0.889331  0.404169
4     E -1.144812  0.545396  1.454070  1.223977

### New Index

In [56]:
newind = 'CA NY WR OR CO'.split()
newind

['CA', 'NY', 'WR', 'OR', 'CO']

In [57]:
df['States'] = newind

In [58]:
df

          W         X         Y         Z States
A -1.026905  0.221749  1.130390  1.146185     CA
B -0.592734  0.118784 -0.484430 -1.944913     NY
C  0.092077  0.902169  1.314469  0.771102     WR
D -0.540147 -0.284115 -0.889331  0.404169     OR
E -1.144812  0.545396  1.454070  1.223977     CO

In [6]:
df.set_index("States") #needs in_place=True

### Multi-Index

In [2]:
outside = "G1 G1 G1 G2 G2 G2".split()
inside = [1,2,3]*2
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [9]:
df = pd.DataFrame(np.random.randn(6,2), hier_index)

In [10]:
df

             0         1
G1 1  0.312565 -0.674081
   2 -2.297232 -0.745111
   3 -0.172690  3.023606
G2 1  0.349471  0.988804
   2 -0.491908 -1.248885
   3 -0.236716 -1.024491

In [11]:
df.loc['G1']

          0         1
1  0.312565 -0.674081
2 -2.297232 -0.745111
3 -0.172690  3.023606

### Cross Section (XS)

In [12]:
df

             0         1
G1 1  0.312565 -0.674081
   2 -2.297232 -0.745111
   3 -0.172690  3.023606
G2 1  0.349471  0.988804
   2 -0.491908 -1.248885
   3 -0.236716 -1.024491

In [14]:
df.loc['G1']

          0         1
1  0.312565 -0.674081
2 -2.297232 -0.745111
3 -0.172690  3.023606

In [20]:
df.xs('G1') #has the ability to skip or go inside a multi level index

          0         1
1  0.312565 -0.674081
2 -2.297232 -0.745111
3 -0.172690  3.023606

In [24]:
df.index.names = ["G", "Num"]

In [25]:
df.xs(1, level="Num")

           0         1
G
G1  0.312565 -0.674081
G2  0.349471  0.988804

## Missing Data

In [27]:
d = {'A':[1,2,np.nan],'B':[5,np.nan, np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)

In [28]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Dropna

In [29]:
df.dropna() #drop any rows with na

     A    B  C
0  1.0  5.0  1

In [32]:
df.dropna(axis=1) #drop any columns with na

   C
0  1
1  2
2  3

### Dropna with threshold

In [33]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Fillna

In [35]:
df.fillna(value="fill value")

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [37]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

![](images/groupby.png)

In [40]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [41]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [45]:
df.groupby("Company") # returns location in memory

In [46]:
df_company = df.groupby("Company")
df_company.mean() #ignores non numeric column

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [47]:
df_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

### All in one line

In [48]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [49]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [50]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging, Joining & Concatenating

In [51]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [52]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [53]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [56]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenate

In [57]:
pd.concat([df1, df2, df3]) #dimensions should match

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
pd.concat([df1, df2, df3], axis=1) #it looks like this because of missing values

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging

In [64]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [65]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [66]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [70]:
pd.merge(left, right, how='inner', on='key') #can pass multiple keys; inner join is default

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Joininig

Join is the same as merge except we are joining on the index instead of a specific column

In [73]:
left.set_index("key", inplace=True)
right.set_index("key", inplace=True)
left.join(right, how='outer')

      A   B   C   D
key
K0   A0  B0  C0  D0
K1   A1  B1  C1  D1
K2   A2  B2  C2  D2
K3   A3  B3  C3  D3

## Operations

In [74]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz